TurboUSD/Node/firmware-esp32/src/main.cpp
// src/main.cpp — TurboUSD Node firmware, ESP32-S3 side.
//
// Responsibilities on this chip: WiFi + provisioning, talking to Supabase,
// rendering the 5 screens with LVGL, reading the touch panel, and telling
// the RP2040 when to buzz. The RP2040 itself only ever receives short
// commands over UART (see rp2040_link.h) -- it never talks to the network.

#include <Arduino.h>
#include <WiFi.h>
#include <time.h>
#include <functional>
#include "config.h"
#include "net_lock.h"
#include "disk_cache.h"
#include "storage.h"
#include "wifi_manager.h"
#include "api_client.h"
#include "rp2040_link.h"
#include "ota_updater.h"
#include "ui/ui_manager.h"
#include "screenshot_server.h"   // http://<ip>/shot.bmp — pixel-perfect captures

// The Arduino loop task defaults to an 8 KB stack, but almost every network
// fetch (treasury, price, debt history, OHLCV, mining) runs a blocking TLS
// handshake straight from loop() — and mbedTLS is very stack-hungry. 8 KB left
// almost no headroom, so a fetch triggered from deep in a large handler (e.g.
// reloading the US-debt chart from inside updateClockIfNeeded) could overflow
// the stack and reboot the device. 16 KB gives comfortable margin for all of
// them. (Global scope: overrides the core's weak getArduinoLoopTaskStackSize.)
SET_LOOP_TASK_STACK_SIZE(16 * 1024);

SemaphoreHandle_t gNetLock = nullptr;   // see net_lock.h

WebLog Log;   // console tee → Serial + WiFi ring buffer (http://<ip>/logs)

Storage storage;
WifiManager wifiManager;
ApiClient apiClient;
Rp2040Link rp2040Link;
OtaUpdater otaUpdater;
UiManager uiManager;

// --- Timers (millis()-based, intentionally not blocking delay()s) ---
uint32_t lastHeartbeatAt        = 0;
uint32_t lastTreasuryRefreshAt  = 0;
uint32_t lastDebtRefreshAt      = 0;
uint32_t lastOhlcvRefreshAt     = 0;
uint32_t lastOtaCheckAt         = 0;
uint32_t lastNtpSyncAt          = 0;
uint32_t lastSensorPollAt       = 0;
uint32_t lastGeoSyncAt          = 0;
uint32_t bootMillis             = 0;

bool nodeRegistered         = false;
bool alarmCurrentlyFiring   = false;
bool bootValidMarked        = false;   // flipped once after first healthy network contact

// Pending OTA update metadata (populated by the nightly check, consumed when
// the user taps "Install" in the UI).
String pendingOtaVersion;
String pendingOtaUrl;
String pendingOtaSha256;

// ── Helpers ───────────────────────────────────────────────────────────────────

void syncTimeFromNtp() {
    // Apply the saved timezone offset (set by geo-IP autodetect, or 0/UTC until
    // the first geo sync) so localtime_r() returns the user's local wall-clock
    // time. daylightOffset is 0 because the geo offset already includes DST.
    configTime(storage.getTzOffsetSec(), 0, "pool.ntp.org", "time.nist.gov");
    Log.printf("NTP sync requested (tz offset %ld s).\n", (long)storage.getTzOffsetSec());
}

// Geo-IP → timezone + regional formatting defaults. Timezone always tracks the
// device's location; the formatting choices (units, date/time order, week start)
// are applied only until the user changes one (then locale is locked).
void autoConfigureLocaleFromGeo() {
    GeoLocale geo;
    if (!apiClient.fetchGeoLocale(geo)) {
        Log.println("Geo locale: lookup failed, keeping current settings.");
        return;
    }

    // Timezone (no manual TZ control exists on-device, so it always follows geo).
    storage.setTzOffsetSec(geo.utcOffsetSec);
    configTime(geo.utcOffsetSec, 0, "pool.ntp.org", "time.nist.gov");

    if (storage.getLocaleLocked()) return; // user owns the formatting choices now

    char tempUnit; String dateFmt, timeFmt; uint8_t weekStart;
    ApiClient::localeDefaultsForCountry(geo.countryCode, tempUnit, dateFmt, timeFmt, weekStart);
    storage.setTempUnit(tempUnit);
    storage.setDateFormat(dateFmt);
    storage.setTimeFormat(timeFmt);
    storage.setWeekStart(weekStart);
    Log.printf("Geo locale: %s offset=%ld → %c %s %s wk%u\n",
                  geo.countryCode, (long)geo.utcOffsetSec, tempUnit,
                  dateFmt.c_str(), timeFmt.c_str(), (unsigned)weekStart);
}

void ensureNodeIsRegistered() {
    if (storage.hasNodeCode()) {
        nodeRegistered = true;
        return;
    }
    String nodeCode;
    if (apiClient.registerNode(nodeCode)) {
        storage.setNodeCode(nodeCode);
        nodeRegistered = true;
        Log.printf("Registered as node %s\n", nodeCode.c_str());
    } else {
        Log.println("Node registration failed, will retry next loop.");
    }
}

// Mark the running image as valid once the device has proven it can reach
// the network and backend. Until this is called after an OTA flash, the
// ESP32 bootloader will revert to the previous image on the next reset --
// that's intentional rollback protection, but we clear it here once we
// know the new firmware is healthy.
void markBootValidIfNeeded() {
    if (bootValidMarked) return;
    if (!nodeRegistered) return;          // wait until we've actually talked to the backend
    OtaUpdater::markBootValid();
    bootValidMarked = true;
}

// Top user button (GPIO 38, active LOW). Short press toggles the screen; a 3 s
// long press puts the device to sleep. By design there is NO factory-reset
// action, so the firmware can't be wiped by holding the button.
void handleUserButton() {
    static bool     prevDown   = false;
    static uint32_t pressStart = 0;
    static bool     longFired  = false;
    // Double-press detection (NFT photo-frame toggle). Only armed while the NFT
    // screen is showing, so single presses stay INSTANT everywhere else.
    static uint32_t lastShortReleaseAt = 0;
    static bool     pendingSingle      = false;
    static uint32_t pendingSingleAt    = 0;
    const  uint32_t DOUBLE_MS = 350;

    bool     down = (digitalRead(BTN_USER_GPIO) == LOW);
    uint32_t now  = millis();

    if (down && !prevDown) { pressStart = now; longFired = false; }   // press begins
    if (down && !longFired && (now - pressStart >= 3000)) {           // long press
        longFired = true;
        pendingSingle = false;                     // don't also fire a deferred toggle
        uiManager.enterSleep();   // returns here once the button wakes it
    }
    if (!down && prevDown) {                                          // released
        uint32_t held = now - pressStart;
        if (!longFired && held >= 40 && held < 3000) {                // short press
            // While the alarm is ringing, the top button STOPS it (same as
            // tapping the on-screen STOP) — much more natural half-asleep
            // than aiming at a touch target.
            if (uiManager.isAlarmOverlayActive()) {
                uiManager.stopRingingAlarm();      // stops the buzzer + closes overlay
            } else if (uiManager.nftDoublePressActive()) {
                // On the NFT screen (or already fullscreen): a SECOND short press
                // within DOUBLE_MS toggles fullscreen; otherwise defer the normal
                // screen toggle so the second press has time to arrive.
                if (now - lastShortReleaseAt < DOUBLE_MS) {
                    lastShortReleaseAt = 0;
                    pendingSingle = false;
                    uiManager.toggleNftFullscreen();
                } else {
                    lastShortReleaseAt = now;
                    pendingSingle = true;
                    pendingSingleAt = now;
                }
            } else {
                uiManager.toggleScreen();           // instant everywhere else
            }
        }
    }
    // Fire a deferred single press once the double-press window has passed.
    if (pendingSingle && now - pendingSingleAt >= DOUBLE_MS) {
        pendingSingle = false;
        uiManager.toggleScreen();
    }
    prevDown = down;
}

void checkAlarmTrigger() {
    time_t now = time(nullptr);
    struct tm t;
    localtime_r(&now, &t); // LOCAL time — the alarm must fire at the user's wall-clock
                           // time, not UTC. Offset is set by syncTimeFromNtp()/geo.

