TurboUSD/Node/firmware-esp32/src/main.cpp
    // Guard: before the first NTP sync `time()` returns a 1970 value, so
    // tm_hour/tm_min are meaningless — never fire (or spam logs) then.
    bool timeValid = (t.tm_year + 1900) >= 2024;

    const bool    enabled     = storage.getAlarmEnabled();
    const bool    activeToday = storage.isAlarmActiveToday(t.tm_wday);
    const uint8_t alarmH      = storage.getAlarmHour();
    const uint8_t alarmM      = storage.getAlarmMinute();
    const uint8_t alarmVol    = storage.getAlarmVolume();
    const bool    timeMatch   = timeValid && t.tm_hour == alarmH && t.tm_min == alarmM;

    // Fire ONCE per target-minute occurrence, but accept the WHOLE minute — not
    // just the first 5 seconds. The old 5-second window (`t.tm_sec < 5`) was the
    // root cause of the silent alarm: a single loop pass that happened to land
    // on a blocking TLS fetch right at HH:MM:00–04 skipped the only window, and
    // the alarm stayed silent for the entire day. Keying off a per-minute id
    // means the alarm fires as long as we run the check AT ALL during that
    // minute (guaranteed — the check runs every loop pass).
    static long lastFiredMinuteId = -1;
    const long minuteId = timeValid
        ? ((long)(t.tm_year) * 366L + t.tm_yday) * 1440L + t.tm_hour * 60L + t.tm_min
        : -1;

    const bool shouldFire = enabled && activeToday && timeMatch && (minuteId != lastFiredMinuteId);

    // Diagnostic: log the alarm decision only when its STATE CHANGES while we're
    // inside the target minute (or the minute right before it), so the log still
    // shows EXACTLY why the alarm did/didn't fire — without the per-second flood
    // that used to spam ~120 identical lines across those two minutes. The FIRING
    // line and the overlay re-send line below cover the actual fire event.
    static int lastLoggedState = -1;
    const bool nearAlarm = timeValid && enabled &&
        (t.tm_hour == alarmH) && (t.tm_min == alarmM || (t.tm_min + 1) % 60 == alarmM);
    const int alarmStateKey = (enabled ? 1 : 0) | (activeToday ? 2 : 0) | (timeMatch ? 4 : 0)
        | ((minuteId == lastFiredMinuteId) ? 8 : 0) | (uiManager.isAlarmOverlayActive() ? 16 : 0);
    if (nearAlarm && alarmStateKey != lastLoggedState) {
        lastLoggedState = alarmStateKey;
        Log.printf("ALARM chk %02d:%02d:%02d | enabled=%d activeToday=%d set=%02u:%02u vol=%u "
                      "timeMatch=%d firedThisMin=%d overlay=%d\n",
                      t.tm_hour, t.tm_min, t.tm_sec, enabled, activeToday, alarmH, alarmM, alarmVol,
                      timeMatch, (minuteId == lastFiredMinuteId), uiManager.isAlarmOverlayActive());
    } else if (!nearAlarm) {
        lastLoggedState = -1;   // re-arm so the next approach logs its first state
    }

    static uint32_t alarmFiredAt = 0;
    if (shouldFire) {
        lastFiredMinuteId = minuteId;
        alarmCurrentlyFiring = true;
        alarmFiredAt = millis();
        Log.printf("ALARM: FIRING now (%02d:%02d:%02d) vol=%u — sending PLAY_ALARM to RP2040\n",
                      t.tm_hour, t.tm_min, t.tm_sec, alarmVol);
        rp2040Link.playAlarm(alarmVol);
        uiManager.showAlarmFiringOverlay();
    } else if (!timeMatch) {
        alarmCurrentlyFiring = false;
    }

    // While the overlay is up (user hasn't tapped STOP), re-send PLAY_ALARM
    // every 10 s. The UART link has no retransmission, so if the single
    // original frame was lost/corrupted the alarm would otherwise stay
    // silent. Re-sending restarts the RP2040's 5-min auto-stop window, so we
    // stop re-sending after 5 min ourselves — an unattended alarm then still
    // goes quiet instead of buzzing forever.
    static uint32_t lastAlarmResendAt = 0;
    if (uiManager.isAlarmOverlayActive()
        && millis() - alarmFiredAt < 5UL * 60UL * 1000UL
        && millis() - lastAlarmResendAt > 10000) {
        lastAlarmResendAt = millis();
        Log.println("ALARM: overlay still up — re-sending PLAY_ALARM to RP2040");
        rp2040Link.playAlarm(alarmVol);
    }
}


void applyPendingOtaUpdate() {
    Log.printf("OTA: user confirmed install of %s\n", pendingOtaVersion.c_str());
    if (otaUpdater.applyPendingUpdate(pendingOtaUrl, pendingOtaSha256)) {
        delay(500);
        ESP.restart();
    } else {
        Log.println("OTA: apply failed. Device continues on current firmware.");
        // Replace the "Downloading..." splash with a clear on-screen error so the
        // user isn't left staring at "Do not turn off" when nothing is happening.
        uiManager.otaFailed("Could not download the update.\nCheck WiFi and try again later.");
        // Clear pending so the badge disappears; next nightly check will re-detect.
        pendingOtaVersion = "";
        pendingOtaUrl = "";
        pendingOtaSha256 = "";
        uiManager.clearOtaBadge();
    }
}

// ── Arduino entry points ──────────────────────────────────────────────────────

void setup() {
    Serial.begin(115200);
    Log.println("\nTurboUSD Node booting, firmware " FIRMWARE_VERSION);

    // Log WHY we booted. If the device is mysteriously restarting (e.g. "it
    // reboots when I open screen X"), this line on the serial monitor tells us
    // whether it was a panic (4), an interrupt/task watchdog (5/6), brownout
    // (9), etc. — invaluable for diagnosing in the field.
    esp_reset_reason_t rr = esp_reset_reason();
    static const char* RR_NAMES[] = {"UNKNOWN","POWERON","EXT","SW","PANIC","INT_WDT",
                                     "TASK_WDT","WDT","DEEPSLEEP","BROWNOUT","SDIO"};
    Log.printf("Reset reason: %d (%s)\n", (int)rr,
                  (rr >= 0 && rr <= 10) ? RR_NAMES[rr] : "?");

    pinMode(BTN_USER_GPIO, INPUT_PULLUP);  // top user button, active LOW

    netLockInit();
    diskcache::init();   // mount the LittleFS art cache (logos/NFTs survive reboots)   // single-TLS-at-a-time lock — see net_lock.h
    storage.begin();
    // Alarm config snapshot at boot — so the serial log always shows what the
    // device thinks the alarm is, independent of the web UI.
    Log.printf("ALARM cfg @boot: enabled=%d %02u:%02u vol=%u days=0x%02X dirty=%d\n",
                  storage.getAlarmEnabled(), storage.getAlarmHour(), storage.getAlarmMinute(),
                  storage.getAlarmVolume(), storage.getAlarmDays(), storage.getAlarmDirty());
    rp2040Link.begin();
    uiManager.begin(); // lv_init + hardware bring-up + build all screens

    uiManager.onAlarmDismissed = [](){ rp2040Link.stopAlarm(); };

    // When the user taps "Install" on the OTA notification, apply it.
    uiManager.onOtaInstallConfirmed = [](){ applyPendingOtaUpdate(); };

    wifiManager.begin(); // connects with saved creds or opens provisioning AP

    bootMillis = millis();
}

void loop() {
    // Poll the user button first so screen-toggle / sleep work in every state
    // (including before WiFi is connected or while the provisioning portal is up).
    handleUserButton();
    rp2040Link.pollRx();   // raw RX monitor — see rp2040_link.h

    // Service LVGL on EVERY iteration, before any network early-return. Otherwise,
    // while provisioning or before WiFi connects, lv_timer_handler() never runs and
    // the RGB panel just shows uninitialized framebuffer garbage — which looks like
    // a display/pin problem but is really "the UI was never drawn".
    uiManager.loop();

