TurboUSD/Node/firmware-esp32/src/main.cpp
    // Link status check ~6/12/20 s after boot. SILENT now (no chime): the link
    // is verified in /logs via the RP2040 heartbeat + ping-OK lines, so there's
    // no need to make the buzzer beep at boot. Only the alarm sounds.
    static int linkChecks = 0;
    static const uint32_t CHECK_AT[3] = { 6000, 12000, 20000 };
    if (linkChecks < 3 && millis() > CHECK_AT[linkChecks]) {
        linkChecks++;
        rp2040Link.printStatus();
        Log.printf("RP-link: status check %d\n", linkChecks);
    }

    // Round-trip test every 30 s, FOREVER (the old one-shot at t=30s was
    // usually missed: serial monitors attach late and the two chips don't
    // reboot together). Every line is decisive:
    //   ping OK        → link alive both ways
    //   heartbeat RECEIVED (from pollRx) but ping FAILED → ESP→RP dead
    //   neither, ever  → RP→ESP dead too (electrical / pad level)
    static uint32_t lastPingAt = 0;
    static int lastPingOk = -1;   // -1 = unknown, 0 = fail, 1 = ok
    if (millis() - lastPingAt > 30000) {
        lastPingAt = millis();
        bool ok = rp2040Link.ping(300);
        // Only log on a STATE CHANGE (first result, or ok<->fail), not every 30 s
        // forever — a steadily-alive link was flooding the log with "ping OK".
        if ((int)ok != lastPingOk) {
            lastPingOk = ok;
            Log.printf("RP-link: ping %s\n", ok ? "OK — link is ALIVE both ways" : "FAILED — no ACK from RP2040");
        }
    }

    // While the provisioning portal is up, prioritize serving it.
    if (wifiManager.isPortalActive()) {
        wifiManager.loopPortal();
        uiManager.showProvisioningScreen();
        return;
    }

    wifiManager.checkConnection(); // reconnect if dropped post-boot

    static bool wifiWasUp = false;
    if (!wifiManager.isConnected()) {
        wifiWasUp = false;   // mark down so mDNS is re-announced on the next connect
        delay(500);
        return;
    }

    // Screenshot server: lazy-started on the first connected pass (the
    // provisioning portal owns port 80 in AP mode, never simultaneously).
    if (!screenshot::started()) screenshot::init();
    // mDNS stops answering after a WiFi reconnect (the responder is bound to the
    // old interface), so re-announce it on every fresh connection — otherwise
    // turbousd.local works on a fresh boot and dies after the first WiFi blip.
    if (!wifiWasUp) {
        wifiWasUp = true;
        screenshot::restartMdns();
    }
    screenshot::poll();

    uint32_t now = millis();

    // ── Network section: runs only when no worker task holds the TLS lock ──
    // Every HTTPS handshake needs ~45 KB of INTERNAL RAM; two at once → 
    // "SSL - Memory allocation failed" everywhere. Workers (tickers/NFT)
    // hold the lock for their whole run; we just postpone to the next pass.
    if (netTryLock()) {

    if (!nodeRegistered) ensureNodeIsRegistered();

    // Mark boot valid once we're healthy — must happen before any OTA check.
    markBootValidIfNeeded();

    if (lastNtpSyncAt == 0 || now - lastNtpSyncAt > NTP_RESYNC_INTERVAL_MS) {
        syncTimeFromNtp();
        lastNtpSyncAt = now;
    }

    // Geo-IP locale autodetect: once on first connect, then twice a day (to
    // follow travel and DST changes). Sets the timezone always, and the regional
    // formatting defaults only until the user overrides them.
    if (lastGeoSyncAt == 0 || now - lastGeoSyncAt > GEO_LOCALE_SYNC_INTERVAL_MS) {
        autoConfigureLocaleFromGeo();
        lastGeoSyncAt = now;
    }

    // First heartbeat fires immediately (lastHeartbeatAt == 0), not 3 minutes
    // in — it's what pulls the web-configured settings (alarm, brightness,
    // tickers order…) down to the device, so a freshly booted node should sync
    // right away.
    if (nodeRegistered && (lastHeartbeatAt == 0 || now - lastHeartbeatAt > HEARTBEAT_INTERVAL_MS)) {
        uint32_t uptimeSeconds = (now - bootMillis) / 1000;
        apiClient.sendHeartbeat(uptimeSeconds);
        // Heartbeat response may have updated screen_brightness in NVS via
        // applyServerConfig(); apply it now so the change is immediate.
        uiManager.applyStoredBrightness();
        uiManager.reloadScreenOrder();   // screen order/visibility too
        lastHeartbeatAt = now;
    }

    // Ticker Stats: the backend ticker-stats function computes the display
    // fields for whichever pool the node has selected (₸USD by default) — the
    // device just paints them. Refetch on the periodic window, after a device
    // pick (tickerStatsConsumeDirty), OR as soon as the selected pool CHANGES —
    // the latter is what makes a WEB change (synced down via the heartbeat
    // config) show up on the device immediately instead of only on the timer.
    {
        static String s_lastTsPool;
        String tsPool = storage.getTickerStatsPool();
        bool poolChanged = (tsPool != s_lastTsPool);
        if (lastTreasuryRefreshAt == 0 || now - lastTreasuryRefreshAt > TREASURY_DATA_REFRESH_MS
            || uiManager.tickerStatsConsumeDirty() || poolChanged) {
            s_lastTsPool = tsPool;
            TickerStats ts = apiClient.fetchTickerStats(storage.getTickerStatsChain(),
                                                        tsPool,
                                                        storage.getTickerStatsSymbol());
            if (ts.valid) uiManager.updateTickerStats(ts);
            lastTreasuryRefreshAt = now;
        }
    }

    // Until the first SUCCESSFUL debt fetch, retry every minute — a failed
    // boot-time fetch used to leave "--" on screen for a whole hour.
    static bool debtLive = false;
    if (lastDebtRefreshAt == 0 ||
        now - lastDebtRefreshAt > (debtLive ? US_DEBT_REFRESH_MS : 60000UL)) {
        DebtData data = apiClient.fetchUsDebt();
        if (data.valid) { uiManager.updateDebtData(data); debtLive = true; }
        else Log.println("fetchUsDebt: no data, retrying in 60 s");
        lastDebtRefreshAt = now;
    }

    // Debt-history self-heal: the chart loads once via updateDebtData, but if
    // that first fetch hit a transient failure (TLS memory, DNS, treasury API
    // hiccup) the chart stayed empty forever. Retry once a minute until real
    // data lands.
    static uint32_t lastDebtHistRetryAt = 0;
    if (!uiManager.debtHistLoaded() && now - lastDebtHistRetryAt > 60000) {
        lastDebtHistRetryAt = now;
        uiManager.retryDebtHistory();
    }

    {
        static String s_lastOhlcvPool;
        String tsPool  = storage.getTickerStatsPool();
        String tsChain = storage.getTickerStatsChain();
        bool ohlcvPoolChanged = (tsPool != s_lastOhlcvPool);
        if (lastOhlcvRefreshAt == 0 || now - lastOhlcvRefreshAt > OHLCV_CHART_REFRESH_MS
            || uiManager.turboTfConsumeDirty()   // 1D/1W/1M dropdown OR device pick
            || ohlcvPoolChanged) {               // web-synced pool change → refetch chart now
            s_lastOhlcvPool = tsPool;
            OhlcvCandle candles[26];
            int count = apiClient.fetchOhlcvHistory(candles, uiManager.turboBars(),
                                                    uiManager.turboGroupDays(),
                                                    tsPool.c_str(), tsChain.c_str());
            if (count > 0) uiManager.loadOhlcvChart(candles, count);
            lastOhlcvRefreshAt = now;
        }
    }

