TurboUSD/Node/firmware-esp32/src/main.cpp
    if (uiManager.isOnNodeScreen() && uiManager.miningFeedNeedsRefresh()) {
        MiningFeedEntry entries[4];
        int count = apiClient.fetchMiningFeed(entries, 4);
        if (count > 0) uiManager.updateMiningFeed(entries, count);
        else           uiManager.retryMiningFeedSoon();   // keep old data, retry in ~3 s
    }

    // Leaderboard (₸ rewards | uptime) under the mining track — refreshed
    // every 60 s while the Node screen is visible.
    static uint32_t lastLeaderboardAt = 0;
    if ((lastLeaderboardAt == 0) ||                     // once at boot → footer node count
        (uiManager.isOnNodeScreen() && now - lastLeaderboardAt > 60000)) {
        lastLeaderboardAt = now;
        LeaderboardEntry lb[24];
        int n = apiClient.fetchNodeDirectory(lb, 24);
        if (n > 0) uiManager.updateLeaderboard(lb, n);
    }

    // OTA: check for a newer firmware AUTOMATICALLY — shortly after boot
    // (lastOtaCheckAt == 0) and then every OTA_CHECK_INTERVAL_MS, at ANY time of
    // day. (It used to only run in a 02:00-04:00 window, so the user never saw
    // it fire.) Never auto-applies: it stores the metadata and shows the SAME
    // bottom badge the manual "Check for updates" uses, so the user confirms the
    // install themselves.
    if (bootValidMarked && pendingOtaVersion.isEmpty()
        && (lastOtaCheckAt == 0 || now - lastOtaCheckAt > OTA_CHECK_INTERVAL_MS))
    {
        lastOtaCheckAt = now;
        String ver, url, sha, notes;
        if (otaUpdater.checkNewVersion(ver, url, sha, notes)) {
            pendingOtaVersion = ver;
            pendingOtaUrl     = url;
            pendingOtaSha256  = sha;
            // Show a persistent badge on all screens; user can dismiss or install.
            uiManager.showOtaBadge(ver.c_str(), notes.c_str());
        }
    }

    // Manual "Check for updates" from the device settings popup. Runs on demand,
    // any time (not just the overnight window). Shows the install badge if a
    // newer image exists, or an "up to date" bar otherwise.
    if (uiManager.otaCheckRequested) {
        uiManager.otaCheckRequested = false;
        String ver, url, sha, notes;
        if (otaUpdater.checkNewVersion(ver, url, sha, notes)) {
            pendingOtaVersion = ver;
            pendingOtaUrl     = url;
            pendingOtaSha256  = sha;
            uiManager.showOtaBadge(ver.c_str(), notes.c_str());
        } else {
            uiManager.showOtaInfo("Firmware is up to date");
        }
    }

    netUnlock();
    }   // end network section

    // Ambient temp/humidity comes from the AHT20 on the RP2040 (the S3 has no
    // sensor of its own). Poll it on a slow cadence; the UI keeps the last good
    // value when a read fails (e.g. no sensor plugged in → header shows "--").
    if (lastSensorPollAt == 0 || now - lastSensorPollAt > SENSOR_POLL_INTERVAL_MS) {
        lastSensorPollAt = now;
        float tempC; int humidityPct;
        if (rp2040Link.readTempHumidity(tempC, humidityPct)) {
            uiManager.updateAmbient(tempC, humidityPct);
        } else {
            uiManager.markAmbientUnavailable();
        }
    }

    checkAlarmTrigger();
    uiManager.loop(); // LVGL tick, touch events, screen redraws
}
